var myQuestions = [
  {
    question: "1. Simplify the ratio \\({36}~{cm}:{45}~{cm}\\).",
    answers: {
      a: '\\({4}:{5}\\)<br>',
      b: '\\({3}:{5}\\)<br>',
      c: '\\({4}:{9}\\)<br>',
      d: '\\({3:4}\\)'
    },
    correctAnswer: 'a'
  },

  {
    question: "2. Simplify the ratio \\({36}~{ft}:{4.5}~{yd}\\).",
    answers: {
      a: '\\({9}:{4}\\)<br>',
      b: '\\({8}:{1}\\)<br>',
      c: '\\({8}:{3}\\)<br>',
      d: '\\({9:1}\\)'
    },
    correctAnswer: 'c'
  },
  
  {
    question: "3. Simplify the rate \\({360}~{km}:{45}~{L}\\).",
    answers: {
      a: '\\({9}~{km/L}\\)<br>',
      b: '\\({8}~{km/L}\\)<br>',
      c: '\\({8.5}~{km/L}\\)<br>',
      d: '\\({7.5}~{km/L}\\)'
    },
    correctAnswer: 'b'
  },

  {
    question: "4. A cylindrical water tank has a diameter of \\({15}~{m}\\) and a height of \\({6}~{m}\\). What is the ratio of its height to its diameter? Simplify.",
    answers: {
      a: '\\({5}:{3}\\)<br>',
      b: '\\({15}:{6}\\)<br>',
      c: '\\({6}:{15}\\)<br>',
      d: '\\({3}:{5}\\)<br>'
    },
    correctAnswer: 'd'
  },

  {
    question: "5. Find the ratio of \\({2}~{hours}\\) to \\({60}~{minutes}\\).Simplify.",
    answers: {
      a: '\\({4}:{3}\\)<br>',
      b: '\\({3}:{4}\\)<br>',
      c: '\\({160}:{2}\\)<br>',
      d: '\\({1}:{80}\\)<br>'
    },
    correctAnswer: 'b'
  },

  {
    question: "6. If a painter can paint \\({140}\\) cylindrical tanks in \\({20}~{days}\\), how many cylindrical tanks can he paint in a day?",
    answers: {
      a: '\\({5}\\)<br>',
      b: '\\({6}\\)<br>',
      c: '\\({7}\\)<br>',
      d: '\\({8}\\)<br>'
    },
    correctAnswer: 'c'
  },

  {
    question: "7. A water pipe can fill a swimming pool in \\({12.5}~{hours}\\). If the pool has a capacity of \\({1,125}~{m^3}\\), what is the flow rate of water in \\({m^3/min}\\)? Round your answer to one decimal place.",
    answers: {
      a: '\\({1.2}~{m^3/min}\\)<br>',
      b: '\\({90.0}~{m^3/min}\\)<br>',
      c: '\\({100.0}~{m^3/min}\\)<br>',
      d: '\\({1.5}~{m^3/min}\\)<br>'
    },
    correctAnswer: 'd'
  },

  {
    question: "8. Which of the following ratios are proportional?",
    answers: {
      a: '\\({2:3}{~}and{~}{4:5}\\)<br>',
      b: '\\({3:4}{~}and{~}{6:9}\\)<br>',
      c: '\\({4:5}{~}and{~}{20:25}\\)<br>',
      d: '\\({3:5}{~}and{~}{6:12}\\)<br>'
    },
    correctAnswer: 'c'
  },

  {
    question: "9. Which of the following ratios are <span style='text-decoration:underline'>not</span> proportional?",
    answers: {
      a: '\\({12:3}{~}and{~}{24:6}\\)<br>',
      b: '\\({12:4}{~}and{~}{16:5}\\)<br>',
      c: '\\({40:5}{~}and{~}{20:2.5}\\)<br>',
      d: '\\({36:6}{~}and{~}{6:1}\\)<br>'
    },
    correctAnswer: 'b'
  },

  {
    question: "10. Solve for \\({x}\\) in the proportion \\({9:x}={12:64}\\) .",
    answers: {
      a: '\\({48}\\)<br>',
      b: '\\({45}\\)<br>',
      c: '\\({32}\\)<br>',
      d: '\\({16}\\)<br>'
    },
    correctAnswer: 'a'
  },

  {
    question: "11. Find \\({x}\\) in the proportion \\({5\\over 16}={x\\over 48}\\) .",
    answers: {
      a: '\\({16}\\)<br>',
      b: '\\({15}\\)<br>',
      c: '\\({10}\\)<br>',
      d: '\\({20}\\)<br>'
    },
    correctAnswer: 'b'
  },

  {
    question: "12. Harris prepared a \\({2,560}~{mL}\\) solution with \\({400}~{mL}\\) of sodium chloride. With the same ratio, how many \\({mL}\\) of sodium chloride does he need to prepare a \\({960}~{mL}\\) solution.",
    answers: {
      a: '\\({50}~{mL}\\)<br>',
      b: '\\({75}~{mL}\\)<br>',
      c: '\\({200}~{mL}\\)<br>',
      d: '\\({150}~{mL}\\)<br>'
    },
    correctAnswer: 'd'
  },

  {
    question: "13. Noli drove \\({6}~{km}\\) in \\({4.5}~{minutes}\\). If he continues with this rate of driving, how far will he be after \\({30}~{minutes}\\)?",
    answers: {
      a: '\\({40}~{km}\\)<br>',
      b: '\\({30}~{km}\\)<br>',
      c: '\\({60}~{km}\\)<br>',
      d: '\\({50}~{km}\\)<br>'
    },
    correctAnswer: 'a'
  },

  {
    question: "<h4>14. A large gear with \\({40}~{teeth}\\) rotates at \\({100}~{rpm}\\). If it turns a small gear of \\({16}~{teeth}\\), how fast does the small gear rotate?</h4> <img src='/1_gear.png' width='110' height='150'>",
    answers: {
      a: '\\({150}~{rpm}\\)<br>',
      b: '\\({175}~{rpm}\\)<br>',
      c: '\\({200}~{rpm}\\)<br>',
      d: '\\({250}~{rpm}\\)',

    },
    correctAnswer: 'd'
  },

  {
    question: "<h4>15. A small pulley with \\({16}~{cm}\\) in diameter rotates at \\({120}~{rpm}\\). If it turns a large pulley at \\({80}~{rpm}\\), what is the diameter of the large pulley?</h4> <img src='/2_pulley.png' width='150' height='150'>",
    answers: {
      a: '\\({24}~{cm}\\)<br>',
      b: '\\({30}~{cm}\\)<br>',
      c: '\\({40}~{cm}\\)<br>',
      d: '\\({32}~{cm}\\)',

    },
    correctAnswer: 'a'
  },

  {
    question: "16. A box is \\({8}~{ft}\\) from the fulcrum and balances the other object \\({6}~{ft}\\) from the fulcrum. If the other object has a mass of \\({72}~{kg}\\), what is the mass of the box?",
    answers: {
      a: '\\({50}~{kg}\\)<br>',
      b: '\\({45}~{kg}\\)<br>',
      c: '\\({54}~{kg}\\)<br>',
      d: '\\({96}~{kg}\\)<br>'
    },
    correctAnswer: 'c'
  },

];

var quizContainer = document.getElementById('quiz');
var resultsContainer = document.getElementById('results');
var submitButton = document.getElementById('submit');

generateQuiz(myQuestions, quizContainer, resultsContainer, submitButton);

function generateQuiz(questions, quizContainer, resultsContainer, submitButton){

  function showQuestions(questions, quizContainer){
    var output = [];
    var answers;
    for(var i=0; i<questions.length; i++){
      answers = [];
      for(choices in questions[i].answers){

        answers.push(
          '<label>'
            + '<input type="radio" name="question'+i+'" value="'+choices+'">'+ choices + '. '+ questions[i].answers[choices] + 
            '</label>'
            +'<br>'
        );

      }
      output.push(
        '<div class="question">'  + questions[i].question + '</div>' + '<div class="answers">'  + answers.join('') + '<br>' + '</div>'
      );
    }
    quizContainer.innerHTML = output.join('');

  }


  function showResults(questions, quizContainer, resultsContainer){
    var answerContainers = quizContainer.querySelectorAll('.answers');
    var userAnswer = '';
    var numCorrect = 0;
  
    for(var i=0; i<questions.length; i++){

      userAnswer = (answerContainers[i].querySelector('input[name=question'+i+']:checked')||{}).value;
      if(userAnswer===questions[i].correctAnswer){

        numCorrect++;
        answerContainers[i].style.color = 'green';
      }
      else{
        answerContainers[i].style.color = 'red';
      }
    }
    resultsContainer.innerHTML = numCorrect + ' out of ' + questions.length + " or " + (numCorrect/questions.length * 100).toFixed(2) + "%";
  }


  showQuestions(questions, quizContainer);
  
  submitButton.onclick = function(){
    showResults(questions, quizContainer, resultsContainer);
  }

}
